# OpenForeignOption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OpenOptions..::..OpenForeignOption Property
OpenOptions Class See Also
---
An option that specifies how to open files saved by an application that was not developed or licensed by Autodesk.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2
# Syntax
C#
---
```text
public OpenForeignOption OpenForeignOption { get; set; }
```

Visual Basic
---
```text
Public Property OpenForeignOption As OpenForeignOption
	Get
	Set
```

Visual C++
---
```text
public:
property OpenForeignOption OpenForeignOption {
	OpenForeignOption get ();
	void set (OpenForeignOption value);
}
```

# ### Field Value
The default value is OpenForeignOption.Open.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
OpenOptions Class
Autodesk.Revit.DB Namespace